# Brewfile - Homebrew dependencies for macOS
# Install with: brew bundle --file=~/.dotfiles/Brewfile
#
# This installs the same packages as install-deps.sh but using Homebrew Bundle.

# Core tools.
brew "zsh"
brew "git"
brew "curl"
brew "wget"

# Required by dotfiles.
brew "fzf"
brew "ripgrep"
brew "bat"
brew "jq"
brew "shellcheck"
brew "direnv"
brew "ccache"

# Recommended tools.
brew "fd"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Build tools (optional - for development).
# brew "cmake"
# brew "ninja"

# Fonts - requires homebrew/cask-fonts tap.
# Uncomment to install MesloLGS Nerd Font:
# tap "homebrew/cask-fonts"
# cask "font-meslo-lg-nerd-font"
